{"Artificer":{"Magical Tinkering":{"name":"Magical Tinkering","description":"At 1st level, you learn how to invest a spark of magic into mundane objects. To use this ability, you must have {@item thieves' tools|PHB} or {@item artisan's tools|PHB} in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:\n{@Choice} The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet. \n{@Choice} Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long. \n{@Choice} The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away. \n{@Choice} A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like. \nThe chosen property lasts indefinitely. As an action, you can touch the object and end the property early. \nYou can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."},"Infuse Item":{"name":"Infuse Item","description":"At 2nd level, you gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.\nArtificers have invented numerous magical infusions, extraordinary processes that rapidly create magic items. To many, artificers seem like wonderworkers, accomplishing in hours what others need weeks to complete.\nThe description of each of the following infusions details the type of item that can receive it, along with whether the resulting magic item requires attunement.\nSome infusions specify a minimum artificer level. You can't learn such an infusion until you are at least that level.\nUnless an infusion's description says otherwise, you can't learn an infusion more than once.\nInfusing an Item:\nWhenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement. \nYour infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one.\nYou can infuse more than one nonmagical object at the end of a long rest; the maximum number of objects appears in the Infused Items column of the Artificer table. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of infusions, the oldest infusion immediately ends, and then the new infusion applies.\nIf an infusion ends on an item that contains other things, like a bag of holding, its contents harmlessly appear in and around its space."},"Right Tool for the Job":{"name":"Right Tool for the Job","description":"At 3rd level, you learn how to produce exactly the tool you need: with {@item thieves' tools|PHB} or {@item artisan's tools|PHB} in hand, you can magically create one set of {@item artisan's tools|PHB} in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again."},"Tool Expertise":{"name":"Tool Expertise","description":"Starting at 6th level, your proficiency bonus is doubled for any ability check you make that uses your proficiency with a tool."},"Flash of Genius":{"name":"Flash of Genius","description":"Starting at 7th level, you gain the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll.\nYou can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest."},"Magic Item Adept":{"name":"Magic Item Adept","description":"When you reach 10th level, you achieve a profound understanding of how to use and make magic items:\nYou can attune to up to four magic items at once.\nIf you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold."},"Spell-Storing Item":{"name":"Spell-Storing Item","description":"At 11th level, you learn how to store a spell in an object. Whenever you finish a long rest, you can touch one {@filter simple or martial weapon|items|source=phb|category=basic|type=martial weapon;simple weapon} or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a 1st- or 2nd-level spell from the {@filter artificer spell list|spells|class=Artificer|cast time=action|level=1;2} that requires 1 action to cast (you needn't have it prepared).\nWhile holding the object, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier. If the spell requires {@status concentration}, the creature must concentrate. The spell stays in the object until it's been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object."},"Magic Item Savant":{"name":"Magic Item Savant","description":"At 14th level, your skill with magic items deepens more:\nYou can attune to up to five magic items at once.\nYou ignore all class, race, spell, and level requirements on attuning to or using a magic item."},"Magic Item Master":{"name":"Magic Item Master","description":"Starting at 18th level, you can attune to up to six magic items at once."},"Soul of Artifice":{"name":"Soul of Artifice","description":"At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection:\nYou gain a +1 bonus to all saving throws per magic item you are currently attuned to.\nIf you're reduced to 0 hit points but not killed outright, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0."}},"Barbarian":{"Rage":{"description":"In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\nWhile raging, you gain the following benefits if you aren't wearing heavy armor:\n{@Choice} You have advantage on Strength checks and Strength saving throws.\n{@Choice} When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.\n{@Choice} You have resistance to bludgeoning, piercing, and slashing damage.\n If you are able to cast spells, you can't cast them or concentrate on them while raging.\n Your rage lasts for 1 minute. It ends early if you are knocked {@condition unconscious} or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\n Once you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th.","name":"Rage"},"Unarmored Defense":{"description":"While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.","name":"Unarmored Defense"},"Danger Sense":{"description":"At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be {@condition blinded}, {@condition deafened}, or {@condition incapacitated}","level":"Barbarian","name":"Danger Sense"},"Reckless Attack":{"description":"Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.","name":"Reckless Attack"},"Extra Attack":{"description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the {@action Attack} action on your turn.","name":"Extra Attack"},"Fast Movement":{"description":"Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor.","name":"Fast Movement"},"Feral Instinct":{"name":"Feral Instinct","description":"By 7th level, your instincts are so honed that you have advantage on initiative rolls.\n Additionally, if you are {@quickref Surprise|PHB|3|0|surprised} at the beginning of combat and aren't {@condition incapacitated}, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."},"Instinctive Pounce":{"name":"Instinctive Pounce","description":"As part of the bonus action you take to enter your rage, you can move up to half your speed."},"Brutal Critical":{"name":"Brutal Critical","description":"Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.\n This increases to two additional dice at 13th level and three additional dice at 17th level."},"Relentless Rage":{"name":"Relentless Rage","description":"Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.\n Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."},"Persistent Rage":{"name":"Persistent Rage","description":"Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."},"Indomitable Might":{"name":"Indomitable Might","description":"Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."},"Primal Champion":{"name":"Primal Champion","description":"At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."}},"Bard":{"Bardic Inspiration":{"name":"Bardic Inspiration", "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature several times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at the 5th level, a d10 at the 10th level, and a d12 at the 15th level."}, "Song of Rest":{"name":"Song of Rest", "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. Suppose you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra {@damage 1d6} hit points. The extra Hit Points increase when you reach certain levels in this class: 9th level {@damage 1d8}, 13th level {@damage 1d10}, and 17th level {@damage 1d12}."}, "Countercharm":{"name":"Countercharm", "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."}},"Cleric":{},"Druid":{"Druidic":{"description":"You know {@language Druidic}, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom ({@skill Perception}) check but can't decipher it without magic.","name":"Druidic"},"Wild Companion (Optional)":{"name":"Wild Companion (Optional)","description":"At 2nd level, you gain the ability to summon a spirit that assumes an animal form: as an action, you can expend a use of your Wild Shape feature to cast the Find Familiar spell, without material components.\nWhen you cast the spell in this way, the familiar is a fey instead of a beast, and the familiar disappears after a number of hours equal to half your druid level."},"Wild Shape":{"description":"3/3 uses (pyramid gave +1),\nstarting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\n You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall {@condition unconscious}, drop to 0 hit points, or die.\n While you are transformed, the following rules apply:\n{@Choice}Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n{@Choice}When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked {@condition unconscious}.\n{@Choice}You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your {@status concentration} on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as {@spell call lightning}, that you've already cast.\n{@Choice}You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as {@sense darkvision}, unless your new form also has that sense.\n{@Choice}You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.","level":"Druid","name":"Wild Shape"},"Cantrip Versatility":{"description":"Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace one cantrip you learned from this class's Spellcasting feature with another cantrip from the druid spell list.","name":"Cantrip Versatility"},"Timeless Body":{"name":"Timeless Body","description":"Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."},"Beast Spells":{"name":"Beast Spells","description":"Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."},"Archdruid":{"name":"Archdruid","description":"At 20th level, you can use your Wild Shape an unlimited number of times.\n Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."},"Circle Forms":{"description":"The rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1. You ignore the Max. CR column of the Beast Shapes table, but must abide by the other limitations there.\nStarting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down.","level":"Druid","name":"Circle Forms"},"Combat Wild Shape":{"description":"When you choose this circle at 2nd level, you gain the ability to use Wild Shape on your turn as a bonus action, rather than as an action.\nAdditionally, while you are transformed by Wild Shape, you can use a bonus action to expend one spell slot to regain 1d8 hit points per level of the spell slot expended.","level":"Druid","name":"Combat Wild Shape"}},"Fighter":{},"Monk":{},"Paladin":{},"Ranger":{},"Rogue":{"Expertise":{"description":"At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with {@item thieves' tools|phb}. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n At 6th level, you can choose two more of your proficiencies (in skills or with {@item thieves' tools|phb}) to gain this benefit.","name":"Expertise"},"Sneak Attack":{"description":"Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.\n You don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't {@condition incapacitated}, and you don't have disadvantage on the attack roll.\n The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table. {@sneak}","level":"Rogue","name":"Sneak Attack"},"Thieves' Cant":{"description":"During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.\n In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run.","name":"Thieves' Cant"},"Cunning Action":{"description":"Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the {@action Dash}, {@action Disengage}, or {@action Hide} action.","name":"Cunning Action"},"Steady Aim":{"description":"As a bonus action, you give yourself advantage on your next attack roll on the current turn. You can use this bonus action only if you haven't moved during this turn, and after you use the bonus action, your speed is 0 until the end of the current turn.","name":"Steady Aim"},"Uncanny Dodge":{"description":"Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.","name":"Uncanny Dodge"},"Evasion":{"name":"Evasion","description":"Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an {@spell ice storm} spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."},"Reliable Talent":{"name":"Reliable Talent","description":"By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a {@dice d20} roll of 9 or lower as a 10."},"Blindsense":{"name":"Blindsense","description":"Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or {@condition invisible} creature within 10 feet of you."},"Slippery Mind":{"name":"Slippery Mind","description":"By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."},"Elusive":{"name":"Elusive","description":"Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't {@condition incapacitated}."},"Stroke of Luck":{"name":"Stroke of Luck","description":"At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the {@dice d20} roll as a 20.\n Once you use this feature, you can't use it again until you finish a short or long rest."},"Fast Hands":{"description":"You can use a Bonus Action granted by CUNNING ACTION to make a Sleight of Hand check, use your Thieves’ Tools to disarm a trap, open a lock, OR take the “Use an object” action.","level":"Rogue","name":"Fast Hands"},"Second-Story Work":{"description":"Climbing no longer costs you extra movement, and when you make a running jumping, the distance you cover increases by +4 feet.","level":"Rogue","name":"Second-Story Work"}},"Sorcerer":{},"Warlock":{},"Wizard":{"Copying a Spell into the Book":{"description":"When you find a wizard spell of 1st level or higher, you can add it to your spellbook if it is of a spell level you can prepare and if you can spare the time to decipher and copy it.\n Copying a spell into your spellbook involves reproducing the basic form of the spell, then deciphering the unique system of notation used by the wizard who wrote it. You must practice the spell until you understand the sounds or gestures required, then transcribe it into your spellbook using your own notation. \nFor each level of the spell, the process takes 2 hours and costs 50 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells.\n A wizard spell on a spell scroll can be copied just as spells in spellbooks can be copied. When you copy a spell from a spell scroll, you must succeed on an Intelligence ({@skill Arcana}) check with a DC equal to 10 + the spell's level. If the check succeeds, the spell is successfully copied. Whether the check succeeds or fails, the spell scroll is destroyed.","name":"Copying a Spell into the Book"},"Replacing the Spell Book":{"description":"You can copy a spell from your own spellbook into another book—for example, if you want to make a backup copy of your spellbook. This is just like copying a new spell into your spellbook, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied spell. \nIf you lose your spellbook, you can use the same procedure to transcribe the spells that you have prepared into a new spellbook. Filling out the remainder of your spellbook requires you to find new spells to do so, as normal. For this reason, many wizards keep backup spellbooks in a safe place.","name":"Replacing the Spell Book"},"Arcane Recovery":{"description":"You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher. For example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots.","name":"Arcane Recovery"},"Cantrip Formulas":{"description":"At 3rd level, you have scribed a set of arcane formulas in your spellbook that you can use to formulate a cantrip in your mind. Whenever you finish a long rest and consult those formulas in your spellbook, you can replace one wizard cantrip you know with another cantrip from the wizard spell list.","name":"Cantrip Formulas"},"Spell Mastery":{"name":"Spell Mastery","description":"At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. \nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."},"Signature Spells":{"name":"Signature Spells","description":"When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest. \nIf you want to cast either spell at a higher level, you must expend a spell slot as normal."},"Adjust Density":{"description":"() = number when high. As an action, you can magically alter the weight of one object or creature you can see within 30 feet of you. The object or creature must be Large or smaller. The target's weight is ½ (⅓) or x2 (x3) for up to 1 (5) minutes or until your concentration ends. Changing +- 10 (20) speed and dis/advantage to strength.","level":"Wizard","name":"Adjust Density"}},"Misc":{"Dash":{"description":"When you take the Dash action, you gain extra movement for the current turn. The increase equals your speed, after applying any modifiers. With a speed of 30 feet, for example, you can move up to 60 feet on your turn if you dash. \nAny increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash.","name":"Dash"},"Disengage":{"description":"If you take the Disengage action, your movement doesn't provoke opportunity attacks for the rest of the turn.","name":"Disengage"},"Dodge":{"description":"When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage. You lose this benefit if you are incapacitated (as explained in the appendix) or if your speed drops to 0.","name":"Dodge"},"Grapple":{"description":"When you want to grab a creature or wrestle with it, you can use the {@action Attack} action to make a special melee attack, a grapple. If you're able to make multiple attacks with the {@action Attack} action, this attack replaces one of them. The target of your grapple must be no more than one size larger than you, and it must be within your reach. \nUsing at least one free hand, you try to seize the target by making a grapple check, a Strength ({@skill Athletics}) check contested by the target's Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check (the target chooses the ability to use). You succeed automatically if the target is {@condition incapacitated}. If you succeed, you subject the target to the {@condition grappled} condition (see the appendix). The condition specifies the things that end it, and you can release the target whenever you like (no action required).\n When you move, you can drag or carry the {@condition grappled} creature with you, but your speed is halved, unless the creature is two or more sizes smaller than you.","name":"Grapple"},"Help":{"description":"You can lend your aid to another creature in the completion of a task. When you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn. \nAlternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective. If your ally attacks the target before your next turn, the first attack roll is made with advantage.","name":"Help"},"Hide":{"description":"When you take the Hide action, you make a Dexterity ({@skill Stealth}) check in an attempt to hide, following the rules in {@book chapter 7 |phb|7|hiding} for hiding. If you succeed, you gain certain benefits, as described in the \"{@book Unseen Attackers and Targets|PHB|9|unseen attackers and targets}\" section in the Player's Handbook.","name":"Hide"},"Response":{"description":"This action is used to respond to the last stat save or check that has been posted. {@respond}","name":"Response"},"Magic Initiate":{"description":"Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class's spell list. In addition, choose one 1st-level spell to learn from that same list.","level":"Misc","name":"Magic Initiate"},"Gifted Scribe":{"description":"Whenever you make an Intelligence (History) or an Ability Check involving Calligrapher's Supplies, you can roll a d4 and add the number rolled to the total ability check.","level":"Misc","name":"Gifted Scribe"},"Piercer":{"description":"Once per turn, when you hit a creature with an attack that deals piercing damage, you can re-roll one of the attack’s damage dice, and you must use the new roll.\nWhen you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes.","level":"Misc","name":"Piercer"},"Scribe's Insight":{"description":"You know the Message cantrip. You can also cast the Comprehend Languages spell with this trait. Starting at 3rd level, you can also cast the Magic Mouth spell with it. Once you cast either spell with this trait, you can't cast that spell again until you finish a Long Rest. Intelligence is your Spellcasting Ability for these spells.","level":"Misc","name":"Scribe's Insight"},"Tail":{"description":"(During Rage) Piercing (Reach): D20+3+2, 1d8+3(+2) {@damage 1d8+5}","level":"Misc","name":"Tail"},"War Caster":{"description":"You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\n{@Choice} You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.\n{@Choice} You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.\n{@Choice} When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature.","level":"Misc","name":"War Caster"},"Darkvision":{"description":"You have a cat's keen eyes, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.","level":"Misc","name":"Darkvision"},"Any-Item Key":{"description":"Gen 2. The Any-Item key is used to turn items into other items. Whether a ball to a house or a car to a pencil. These transformations are permanent till the key is used once more. This can not change states (Liquid, Solid, or Air), and can only change items (not liquid or air). This just changes appearance.\n{@Choice}When turning the key to the right and taking it out, whatever item the user thinks of will become reality.\n{@Choice}When turning to the left it will undo whatever item was turned. \n(The key is using the Key Points system, or KP for short. KP the user has is = Spell casting modifier + Proficiency + Character level. You regenerate KP after a long rest. To turn this key left to undo a transformation costs 2 KP, no matter the size. To turn an item into something of similar size it costs 3 KP. To make something bigger or smaller it costs 3 + how many sizes change. Some sizes are, Tiny, Small, medium, huge, and giant. Tiny is baseball and smaller, small is a basketball, medium is human 5’9”, huge is a normal car size, and giant is a house and bigger. An example Baseball to a Basketball would take 4 KP. Baseball to a human size cutout would be 5 KP. House to a car would be 4 KP.)","level":"Items","name":"Any-Item Key"},"Dagger":{"description":"Simple dagger {@damage 1d4+2}","level":"Items","name":"Dagger"},"High Higher Gravity":{"description":"when Razor is high, gravitational magic is stronger. Scores in () with gravity are in effect when Razor is high.","level":"Semblance","name":"High Higher Gravity"},"High Up Weightless":{"description":"When Razor is high, she can select two items up to 25 lbs each, or one item up to 50 lbs and cause them to be weightless for an action. These items follow the rules of zero gravity, if an item is pushed it will keep going that way till it hits something or is slowed down by air resistance. Razor can change items at any time using her bonus action, and can resume normal gravity at any time.","level":"Semblance","name":"High Up Weightless"},"Zero Footing":{"description":"2 times per long rest you can select a person and apply zero gravity to them. This will take away their next turn from the confusion of floating away and for a minute, or till Razor stops they will not be able to move.","level":"Semblance","name":"Zero Footing"},"Form Of The Beast":{"description":"Starting when you choose this path at 3rd level, when you enter your rage, you can transform, revealing the bestial power within you. Until the rage ends, you manifest a natural weapon. It counts as a simple melee weapon for you, and you add your Strength modifier to the attack and damage rolls when you attack with it, as normal.\nYou choose the weapon’s form each time you rage:\n{@Choice} Tail. You grow a lashing, spiny tail, which deals 1d8 piercing damage on a hit and has the reach property. If a creature you can see within 10 feet of you hits you with an attack roll, you can use your reaction to swipe your tail and roll a d8 {@sDice 1d8}, applying a bonus to your AC equal to the number rolled, potentially causing the attack to miss you.","level":"Beast Barbarian","name":"Form Of The Beast"},"Gnome Cunning":{"description":"You have advantage on all Intelligence, Wisdom, and Charisma saves against magic.","level":"Gnome","name":"Gnome Cunning"},"Javelin":{"description":"Piercing (30/120) 5/5: D20+3+2, 1d6+3(+2) {@damage 1d6+5}","level":"Items","name":"Javelin"},"Pike":{"description":"Piercing (Reach): D20+3+2, 1d8+3(+2) {@damage 1d8+5}","level":"Items","name":"Pike"},"Shadow Key":{"description":"Gen 3. The Shadow Key is used to animate shadows and travel through them.\n{@Choice}If the key is inserted into a shadow and turned to the left, the shadow will engolf you. Allowing you to travel through the shadows, (Cast Misty Step) using KP.\n{@Choice}If you turn the key to the right, you will summon a shadow creature that will do your bidding. These shadows have player lvl * 4 hp, and can do a claw attack. (Claws. Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: (2d6 + 4) slashing damage.) These creatures are able to get hit by physical damage, as they have a form. They can only last an hour from creation {@Summon shadow:currentLv*4:grey}. \n(The key is using the Key Points system, or KP for short. KP the user has is = Spell casting modifier + Proficiency + Character level. You regenerate KP after a long rest. To travel the shadows takes 3KP, to summon a shadow it takes 5KP.","level":"Items","name":"Shadow Key"},"Counterbalance":{"description":"When successfully making a melee attack against an enemy not within 5ft with a reach weapon you may expend 1AP to deal an additional amount of damage equal to your proficiency bonus and move to any free space within 10ft of the target as you vault yourself using the weapon as part of the attack. This movement does not provoke any attack of opportunity. Cannot be activated on Gargantuan creatures.","level":"Semblance","name":"Counterbalance"},"Tricksy Tail":{"description":"When successfully making a melee attack with your tail you are able do one of two things:\n{@Choice} Push the target 5 * half your proficiency bonus rounded up feet backward from you from your hit with force.\n{@Choice} Your tail wraps around your target, roll a strength check adding your proficiency bonus against their strength or dexterity of your target. If you succeed they will be grapped with your tail till you let them go, or attack with your tail again.","level":"Semblance","name":"Tricksy Tail"},"Shadow's Claws":{"description":"Claws. Melee Weapon Attack: +5 to hit {@+5toHit}, reach 5 ft., one target. Hit: (2d6 + 4) slashing damage {@damage 2d6+4}.","level":"Shadow","name":"Shadow's Claws"},"Fairy Magic":{"description":"You know the druidcraft cantrip. Starting at 3rd level, you can cast the faerie fire spell with this trait. Starting at 5th level, you can also cast the enlarge/reduce spell with this trait. Once you cast faerie fire or enlarge/reduce with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level. Wisdom is spellcasting mod.","level":"Fairy","name":"Fairy Magic"},"Flight":{"description":"Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor.","level":"Fairy","name":"Flight"},"Alpha Predator":{"description":"Passive, AP reduction\nWhen wildshaped, the form Cookie takes has the following bonuses: \nA bonus to saving throws equal to her wisdom modifier.","level":"Semblance","name":"Alpha Predator"},"Cat’s Tongue":{"description":"You have proficiency in the Performance and Persuasion skills, and you can speak fluently to felines.","level":"Felis","name":"Cat’s Tongue"},"Feline Agility":{"description":"Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the tum. Once you use this trait, you can't use it again until you move 0 feet on one of your turns.","level":"Felis","name":"Feline Agility"},"Feline Evasiveness":{"description":"Your quick thinking and dexterous movements allow you to avoid enemy attacks. When you move, you can use a bonus action to not provoke attacks of opportunity for the rest of the turn. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.","level":"Felis","name":"Feline Evasiveness"},"Dagger Of Truth":{"description":"Relic, a person you are not allied with, stabbed with this dagger can only tell the truth till long rest, if they answer a yes or no question or anything of the sort, they must follow through with it. Can be used twice a day. {@damage 1d4+6}","level":"Items","name":"Dagger Of Truth"},"Teleport Crystal":{"description":"This crystal can be used to teleport to way stones in different areas. Needs to be charged up with magic before use. Up to 4 people can come along. 1MP per person.","level":"Items","name":"Teleport Crystal"},"Whip Sword":{"description":"Reach of 10ft, starts as a sword, when whipped the segments break apart to strike. {@damage 1d8+2}","level":"Items","name":"Whip Sword"},"Absorption":{"description":"When you have contact with a magic item, attack, or spell, you may roll a Dice depending on the level of the spell. If you roll a 1 on the d4 you absorb the magic and gain an amount of MP the amount equal to the spell level. You may absorb Magic 5 times per long rest and may attempt to absorb every 7 seconds (1 round in combat). {@absorb}\n{@Choice} Lvl 1: 1 on a d4\n{@Choice} Lvl 2: 1 on a d6\n{@Choice} Lvl 3: 1 on a d8\n{@Choice} Lvl 4: 1 on a d10\n{@Choice} Lvl 5: 1 on a d12\n{@Choice} Lvl 6: 1 on a d14\n{@Choice} Lvl 7: 1 on a d16\n{@Choice} Lvl 8: 1 on a d18\n{@Choice} Lvl 9: 1 on a d20","level":"Semblance","name":"Absorption"},"MP Usage":{"description":"On a successful hit you may spend the MP to add an additional +2 to your total damage. UPGRADE - You can infuse MP into Objects and people, restoring items and making others stronger. (MP amount gives spell slot back or amount of hp for nonspell casters) {@absorb}\n{@Choice} 1MP: 1st Lvl Slot or 1d4 healing\n{@Choice} 2MP: 2nd Lvl Slot or 1d6 healing\n{@Choice} 3MP: 3rd Lvl Slot or 1d8 healing\n{@Choice} 4MP: 4th Lvl Slot or 1d10 healing\n{@Choice} 5MP: 5th Lvl Slot or 1d12 healing\n{@Choice} 6MP: 6th Lvl Slot or 1d14 healing\n{@Choice} 7MP: 7th Lvl Slot or 1d16 healing\n{@Choice} 8MP: 8th Lvl Slot or 1d18 healing\n{@Choice} 9MP: 91h Lvl Slot or 1d20 healing","level":"Semblance","name":"MP Usage"},"Absorb Enviornment":{"description":"Harold can absorb the environment to create dead spots (Exastion 2, \tSpeed halved and Disadvantage on ability checks) under him and heal {@sDice 2d6} {@Summon drain-:0:invisible}","level":"Harold","name":"Absorb Enviornment"},"Beastly Claws":{"description":"{+5toHit}, {@damage 3d8+3} damage, healing ½ of damage dealt.","level":"Harold","name":"Beastly Claws"},"Beastly Fangs":{"description":"{+6toHit}, {@damage 4d6+3} damage, healing ½ of damage delt","level":"Harold","name":"Beastly Fangs"},"Summon MV Elemental":{"description":"Summons a MV Elemental within 20ft of the caster. {@Summon MVElemental-:40:red}","level":"Harold","name":"Summon MV Elemental"},"Improvised Weapon Stapler":{"description":"{@damage 1d4+2} piercing damage and {+2toHit}","level":"Improvised Weapons","name":"Improvised Weapon Stapler"},"Bite":{"description":"Melee Weapon Attack: {+4toHit}, reach 5 ft., one target. Hit: {@damage 2d8+5} piercing damage. If the target is a creature, it must succeed on a {@save} Strength saving throw or be knocked prone.","level":"MV","name":"Bite"},"Expel Flames":{"description":"After someone is trapped in a bite, the creature will expel flames from it's throat. The trapped creature must make Dexterity saving throw. {@save 4d6+2} fire damage on a failed save, or half damage on a successful one.","level":"MV","name":"Expel Flames"},"Fire Breath":{"description":"The target must make a Dexterity saving throw, taking {@save 4d6} fire damage on a failed save, or half damage on a successful one.","level":"MV","name":"Fire Breath"},"Life-Steal":{"description":"After doing damage, this user heals 1/2 of the damage dealt by their body.","level":"MV","name":"Life-Steal"},"Body Slam":{"description":"Melee Weapon Attack: {+8toHit}, reach 5 ft., one target. Hit: {@damage 2d8+5) bludgeoning damage.","level":"MV Elemental","name":"Body Slam"},"Ram":{"description":"Melee Weapon Attack: {+3toHit}, reach 5 ft., one target. Hit: {@damage 2d4+1} and {@sDice 3d4} fire damage. bludgeoning damage.","level":"Satyr","name":"Ram"},"Short Sword":{"description":"Melee Weapon Attack: {+5toHit}, reach 5 ft., one target. Hit: {@damage 1d6+3} and {@sDice 3d4} fire damage piercing damage.","level":"Satyr","name":"Short Sword"},"Scimitar":{"description":"Melee Weapon Attack: {+5toHit}, reach 5 ft., one target. Hit: {@damage 2d6+5} slashing damage.","level":"Scientist","name":"Scimitar"},"Invisibility":{"description":"The sprite magically turns invisible until it attacks or casts a spell, or until its concentration ends (as if concentrating on a spell). Any equipment the sprite wears or carries is invisible with it.","level":"Sprite","name":"Invisibility"},"Baleful Baying":{"description":"The yeth hound bays magically. Every enemy within 300 feet of the hound that can hear it must succeed on a Wisdom saving throw {@save} or be frightened until the end of the hound’s next turn or until the hound is incapacitated. A frightened target that starts its turn within 30 feet of the hound must use all its movement on that turn to get as far from the hound as possible, must finish the move before taking an action, and must take the most direct route, even if hazards lie that way. A target that successfully saves is immune to the baying of all yeth hounds for the next 24 hours.","level":"Yeth","name":"Baleful Baying"},"Yeth Bite":{"description":"Melee Weapon Attack: {+6toHit}, reach 5 ft., one target. Hit: {@damage 2d6+4} piercing damage, plus {@sDice 4d6} psychic damage if the target is frightened.","level":"Yeth","name":"Yeth Bite"},"Great Axe On Fire":{"description":"Weapon {+5toHit} vs. AC; {@damage 1d12+5} + {@sDice 1d10} fire damage.","level":"Zotan","name":"Great Axe On Fire"},"Great Axe Spin":{"description":"The Warforge will disconnect its spine and spin rapidly, performing a Great Axe on fire attack in the 3x3 square with it at the center.","level":"Zotan","name":"Great Axe Spin"},"Enhanced Rage":{"description":"Enhanced by Fae magics, you feel the magic coursing through your veins. When in raged you can roll {@sDice 2d6+2} for each attack, as they get boasted with your access magic.","level":"Misc","name":"Enhance Rage"},"Enhanced Wild Shape":{"description":"Enhanced by Fae magics, you feel the magic coursing through your veins. You can roll {@sDice 2d6+2} for each attack, as they get boasted with your access magic in shapeshifting form.","level":"Misc","name":"Enhanced Wild Shape"}},"Backup":{"hold":{"hold":"hold"},"Any-Item Key":{"name":"Any-Item Key","description":"Gen 2. The Any-Item key is used to turn items into other items. Whether a ball to a house or a car to a pencil. These transformations are permanent till the key is used once more. This can not change states (Liquid, Solid, or Air), and can only change items (not liquid or air). This just changes appearance.\n{@Choice}When turning the key to the right and taking it out, whatever item the user thinks of will become reality.\n{@Choice}When turning to the left it will undo whatever item was turned. \n(The key is using the Key Points system, or KP for short. KP the user has is = Spell casting modifier + Proficiency + Character level. You regenerate KP after a long rest. To turn this key left to undo a transformation costs 2 KP, no matter the size. To turn an item into something of similar size it costs 3 KP. To make something bigger or smaller it costs 3 + how many sizes change. Some sizes are, Tiny, Small, medium, huge, and giant. Tiny is baseball and smaller, small is a basketball, medium is human 5’9”, huge is a normal car size, and giant is a house and bigger. An example Baseball to a Basketball would take 4 KP. Baseball to a human size cutout would be 5 KP. House to a car would be 4 KP.)"},"Dagger":{"name":"Dagger","description":"Simple dagger {@damage 1d4+2}"},"High Higher Gravity":{"name":"High Higher Gravity","description":"when Razor is high, gravitational magic is stronger. Scores in () with gravity are in effect when Razor is high."},"High Up Weightless":{"name":"High Up Weightless","description":"When Razor is high, she can select two items up to 25 lbs each, or one item up to 50 lbs and cause them to be weightless for an action. These items follow the rules of zero gravity, if an item is pushed it will keep going that way till it hits something or is slowed down by air resistance. Razor can change items at any time using her bonus action, and can resume normal gravity at any time."},"Zero Footing":{"name":"Zero Footing","description":"2 times per long rest you can select a person and apply zero gravity to them. This will take away their next turn from the confusion of floating away and for a minute, or till Razor stops they will not be able to move."},"Form Of The Beast":{"name":"Form Of The Beast","description":"Starting when you choose this path at 3rd level, when you enter your rage, you can transform, revealing the bestial power within you. Until the rage ends, you manifest a natural weapon. It counts as a simple melee weapon for you, and you add your Strength modifier to the attack and damage rolls when you attack with it, as normal.\nYou choose the weapon’s form each time you rage:\n{@Choice} Tail. You grow a lashing, spiny tail, which deals 1d8 piercing damage on a hit and has the reach property. If a creature you can see within 10 feet of you hits you with an attack roll, you can use your reaction to swipe your tail and roll a d8 {@sDice 1d8}, applying a bonus to your AC equal to the number rolled, potentially causing the attack to miss you."},"Darkvision":{"name":"Darkvision","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},"Gnome Cunning":{"name":"Gnome Cunning","description":"You have advantage on all Intelligence, Wisdom, and Charisma saves against magic."},"Javelin":{"name":"Javelin","description":"Piercing (30/120) 5/5: D20+3+2, 1d6+3(+2) {@damage 1d6+5}"},"Pike":{"name":"Pike","description":"Piercing (Reach): D20+3+2, 1d8+3(+2) {@damage 1d8+5}"},"Shadow Key":{"name":"Shadow Key","description":"Gen 3. The Shadow Key is used to animate shadows and travel through them.\n{@Choice}If the key is inserted into a shadow and turned to the left, the shadow will engolf you. Allowing you to travel through the shadows, (Cast Misty Step) using KP.\n{@Choice}If you turn the key to the right, you will summon a shadow creature that will do your bidding. These shadows have player lvl * 4 hp, and can do a claw attack. (Claws. Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: (2d6 + 4) slashing damage.) These creatures are able to get hit by physical damage, as they have a form. They can only last an hour from creation {@Summon shadow:currentLv*4:grey}. \n(The key is using the Key Points system, or KP for short. KP the user has is = Spell casting modifier + Proficiency + Character level. You regenerate KP after a long rest. To travel the shadows takes 3KP, to summon a shadow it takes 5KP."},"Counterbalance":{"name":"Counterbalance","description":"When successfully making a melee attack against an enemy not within 5ft with a reach weapon you may expend 1AP to deal an additional amount of damage equal to your proficiency bonus and move to any free space within 10ft of the target as you vault yourself using the weapon as part of the attack. This movement does not provoke any attack of opportunity. Cannot be activated on Gargantuan creatures."},"Tricksy Tail":{"name":"Tricksy Tail","description":"When successfully making a melee attack with your tail you are able do one of two things:\n{@Choice} Push the target 5 * half your proficiency bonus rounded up feet backward from you from your hit with force.\n{@Choice} Your tail wraps around your target, roll a strength check adding your proficiency bonus against their strength or dexterity of your target. If you succeed they will be grapped with your tail till you let them go, or attack with your tail again."},"Shadow's Claws":{"name":"Shadow's Claws","description":"Claws. Melee Weapon Attack: +5 to hit {@+5toHit}, reach 5 ft., one target. Hit: (2d6 + 4) slashing damage {@damage 2d6+4}."},"Fairy Magic":{"name":"Fairy Magic","description":"You know the druidcraft cantrip. Starting at 3rd level, you can cast the faerie fire spell with this trait. Starting at 5th level, you can also cast the enlarge/reduce spell with this trait. Once you cast faerie fire or enlarge/reduce with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level. Wisdom is spellcasting mod."},"Flight":{"name":"Flight","description":"Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."},"Alpha Predator":{"name":"Alpha Predator","description":"Passive, AP reduction\nWhen wildshaped, the form Cookie takes has the following bonuses: \nA bonus to saving throws equal to her wisdom modifier."}, "Cat’s Tongue":{"name":"Cat’s Tongue","description":"You have proficiency in the Performance and Persuasion skills, and you can speak fluently to felines."},"Feline Agility":{"name":"Feline Agility","description":"Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the tum. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."},"Feline Evasiveness":{"name":"Feline Evasiveness","description":"Your quick thinking and dexterous movements allow you to avoid enemy attacks. When you move, you can use a bonus action to not provoke attacks of opportunity for the rest of the turn. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},"Dagger Of Truth":{"name":"Dagger Of Truth","description":"Relic, a person you are not allied with, stabbed with this dagger can only tell the truth till long rest, if they answer a yes or no question or anything of the sort, they must follow through with it. Can be used twice a day. {@damage 1d4+6}"},"Teleport Crystal":{"name":"Teleport Crystal","description":"This crystal can be used to teleport to way stones in different areas. Needs to be charged up with magic before use. Up to 4 people can come along. 1MP per person."},"Whip Sword":{"name":"Whip Sword","description":"Reach of 10ft, starts as a sword, when whipped the segments break apart to strike. {@damage 1d8+2}"},"Absorption":{"name":"Absorption","description":"When you have contact with a magic item, attack, or spell, you may roll a Dice depending on the level of the spell. If you roll a 1 on the d4 you absorb the magic and gain an amount of MP the amount equal to the spell level. You may absorb Magic 5 times per long rest and may attempt to absorb every 7 seconds (1 round in combat). {@absorb}\n{@Choice} Lvl 1: 1 on a d4\n{@Choice} Lvl 2: 1 on a d6\n{@Choice} Lvl 3: 1 on a d8\n{@Choice} Lvl 4: 1 on a d10\n{@Choice} Lvl 5: 1 on a d12\n{@Choice} Lvl 6: 1 on a d14\n{@Choice} Lvl 7: 1 on a d16\n{@Choice} Lvl 8: 1 on a d18\n{@Choice} Lvl 9: 1 on a d20"},"MP Usage":{"name":"MP Usage","description":"On a successful hit you may spend the MP to add an additional +2 to your total damage. UPGRADE - You can infuse MP into Objects and people, restoring items and making others stronger. (MP amount gives spell slot back or amount of hp for nonspell casters) {@absorb}\n{@Choice} 1MP: 1st Lvl Slot or 1d4 healing\n{@Choice} 2MP: 2nd Lvl Slot or 1d6 healing\n{@Choice} 3MP: 3rd Lvl Slot or 1d8 healing\n{@Choice} 4MP: 4th Lvl Slot or 1d10 healing\n{@Choice} 5MP: 5th Lvl Slot or 1d12 healing\n{@Choice} 6MP: 6th Lvl Slot or 1d14 healing\n{@Choice} 7MP: 7th Lvl Slot or 1d16 healing\n{@Choice} 8MP: 8th Lvl Slot or 1d18 healing\n{@Choice} 9MP: 91h Lvl Slot or 1d20 healing"}},"Infused":{"Ghostly Beginings":{"description":"Your ghost infusion grants you many benefits, and drawbacks. The more stronger this side of you get, the less control of your body you have. By unlocking this skill you gain resistance to Cold & Necrotic. You also gain Ghost Mode, an active ability by using an action your ghostly side grows temporally (5 Turns) to boost your abilities. In Ghost Mode you gain the ability to levitate (While on the ground) you can float up to 10 feet off the ground, and can see up too 60 feet in the Ethereal Plane. Ghost mode can be used as much times as you have proficiency bonus. For these benefits you gain 15% Infusion Rate, once you hit 100% you will become permanently your chosen animal/beast forever. When in an interaction that may have your infused side wanting to do something, you must roll a d100 if you roll above your Infusion Rate you resist that action.","name":"Ghostly Beginings"}, "Ghostly Beginings (10 Turns)":{"description":"Your ghost infusion grants you many benefits, and drawbacks. The more stronger this side of you get, the less control of your body you have. By unlocking this skill you gain resistance to Cold & Necrotic. You also gain Ghost Mode, an active ability by using an action your ghostly side grows temporally (10 Turns) to boost your abilities. In Ghost Mode you gain the ability to levitate (While on the ground) you can float up to 10 feet off the ground, and can see up too 60 feet in the Ethereal Plane, with darkvisoin in both for 60 as well. Ghost mode can be used as much times as you have proficiency bonus. For these benefits you gain 15% Infusion Rate, once you hit 100% you will become permanently your chosen animal/beast forever. When in an interaction that may have your infused side wanting to do something, you must roll a d100 if you roll above your Infusion Rate you resist that action.","name":"Ghostly Beginings (10 Turns)"}, "Ghost Phasing":{"description":"Like other ghost being able to travel through objects and people, with this upgrade you can as well. While in Ghost mode for an action, you are able to move through any solid (non-moving) object/people as long as it is less then 3 feet wide. Your physical body can't go beyond this amount, at least with this much Infusion Rate.","name":"Ghost Phasing"}, "Improved Ghost Phasing":{"description":"By unlocking this your Ghost Mode phasing can go up to 5 feet in depth instead of the normal 3ft. As an extra benefit you are able to phase through moving things now as well.","name":"Improved Ghost Phasing"}, "Ghost Wildshape":{"description":"By having your ghostly side take over majority of your body you will be able to wildshape into a ghost (Using D&D 5e Stat Block) for an action, this can be done proficiency bonus / 2 (rounded down) times a day. You can stay a ghost for up to 5 turns or until your HP drops to 0 (Any overflow will go to your normal hp same as druid) Once unwildshaped, you must wait 10 minutes before using the ability again, as your ghost side needs time to recharge.","name":"Ghost Wildshape"}, "Enhanced Ghost Wildshape":{"description":"By having your ghostly side take over majority of your body you will be able to wildshape into a ghost (Using D&D 5e Stat Block) for an action, this can be done proficiency bonus times a day. You can stay a ghost for up to 10 turns or until your HP drops to 0 (Any overflow will go to your normal hp same as druid) Once unwildshaped, you must wait 5 minutes before using the ability again, as your ghost side needs time to recharge.","name":"Enhanced Ghost Wildshape"}, "Ghostly Possession":{"description":"By unlocking this you are now able to possess people and items while in Ghost Mode. A humanoid must succeed on a D13 Charisma saving through, or be possessed by you. Your body fuses into your target and you can pilot the person, you keep your Int, Wis, & Char, but don't gain access to target's knowledge, class features, or proficiencies. Once the target's HP drop to 0, or you end on bonus action you are kicked out of the target. When possessing objects, you are able to hear, smell, see, and feel what is around you. You can also vibrate or manipulate objects if they are designed to do so (Flipping a lever, pushing a button).","name":"Ghostly Possession"}, "Improved Ghostly Levitation":{"description":"By unlocking this your levitation from your Ghost Mode goes up to a full 40 feet and can be activated while midair. For these benefits you gain 10% more Infusion Rate.","name":"Improved Ghostly Levitation"}, "Ghostly Etherealness":{"description":"While in Ghost Mode, you can positions your body in between both Material plane and Ethereal Plane for an action. While in between the two realms you are visible on both planes, yet you can't affect either and they can't affect you. You can regain full access to material plane at any time, or forcefully when Ghost Mode ends.","name":"Ghostly Etherealness"}}}