{
    "Garrett" : 
    {
        "ability1" : 
        {
            "name" : "Ghostly Beginnings",
            "desc" : "Your ghost infusion grants you many benefits, and drawbacks. The more stronger this side of you get, the less control of your body you have. By unlocking this skill you gain resistance to Cold & Necrotic. You also gain Ghost Mode, an active ability by using an action your ghostly side grows temporally (5 Turns) to boost your abilities. In Ghost Mode you gain the ability to levitate (While on the ground) you can float up to 10 feet off the ground, and can see up too 60 feet in the Ethereal Plane. Ghost mode can be used as much times as you have proficiency bonus. For these benefits, you gain 15% Infusion Rate, once you hit 100% you will become permanently your chosen animal/beast forever. When in an interaction that may have your infused side wanting to do something, you must roll a d100 if you roll above your Infusion Rate you resist that action.",
            "infusionRate" : 15
        },
        
        "ability2" : 
        {
            "name" : "Ghost Phasing",
            "desc" : "Like other ghost being able to travel through objects and people, with this upgrade you can as well. While in Ghost mode for an action, you are able to move through any solid (non-moving) object/people as long as it is less then 3 feet wide. Your physical body can't go beyond this amount, at least with this much Infusion Rate. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "ability3" : 
        {
            "name" : "Ghost Wildshape",
            "desc" : "By having your ghostly side take over majority of your body you will be able to wildshape into a ghost (Using D&D 5e Stat Block) for an action, this can be done proficiency bonus / 2 (rounded down) times a day. You can stay a ghost for up to 5 turns or until your HP drops to 0 (Any overflow will go to your normal hp same as druid) Once unwildshaped, you must wait 10 minutes before using the ability again, as your ghost side needs time to recharge. For these benefits, you gain 15% more Infusion Rate.",
            "infusionRate" : 15
        },

        "ability4" : 
        {
            "name" : "Ghostly Possession",
            "desc" : "By unlocking this you are now able to possess people and items while in Ghost Mode. A humanoid must succeed on a D13 Charisma saving through, or be possessed by you. Your body fuses into your target and you can pilot the person, you keep your Int, Wis, & Char, but don't gain access to target's knowledge, class features, or proficiencies. Once the target's HP drop to 0, or you end on bonus action you are kicked out of the target. When possessing objects, you are able to hear, smell, see, and feel what is around you. You can also vibrate or manipulate objects if they are designed to do so (Flipping a lever, pushing a button). For these benefits, you gain 15% more Infusion Rate.",
            "infusionRate" : 10
        },

        "ability5" : 
        {
            "name" : "Ghostly Etherealness",
            "desc" : "While in Ghost Mode, you can positions your body in between both Material plane and Ethereal Plane for an action. While in between the two realms you are visible on both planes, yet you can't affect either and they can't affect you. You can regain full access to material plane at any time, or forcefully when Ghost Mode ends. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade1" : 
        {
            "name" : "Longer Ghost Mode",
            "desc" : "By unlocking this your Ghost Mode ability will be able to be held for 10 turns instead of the normal 5. As a bonus you also will gain 60 feet of Darkvision for both Material and Ethereal Plane. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade2" : 
        {
            "name" : "Improved Ghost Phasing",
            "desc" : "By unlocking this your Ghost Mode phasing can go up to 5 feet in depth instead of the normal 3ft. As an extra benefit you are able to phase through moving things now as well. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade3" : 
        {
            "name" : "Improved Ghostly Levitation",
            "desc" : "By unlocking this your levitation from your Ghost Mode goes up to a full 40 feet and can be activated while midair. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade4" : 
        {
            "name" : "Enhanced Ghost Wildshape",
            "desc" : "By unlocking this your Ghost Wildshape gains stronger giving you many upgrades. You can now wildshape up to your proficiency bonus instead of pb/2. You also can remain in wildshape for up to 10 turns, and only need to wait 5 minutes instead of the 10 to wildshape. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        }
    },

    "Ben" : 
    {
        "ability1" : 
        {
            "name" : "Swift Ferret",
            "desc" : "Your ferret infusion grants you many benefits, and drawbacks. The stronger this side of you gets, the less control of your body you have. By unlocking this skill you gain an advantage on  Wisdom (Perception) checks that rely on hearing or smell. You also gain Ferret Mode, an an active ability by using an action your ferret side grows temporally (5 Turns) to boost your abilities. In Ferret Mode you gain the ability to do an extra bonus action from your excess energy. Also in the Ferret Mode, you can use your action to do a little ferret dance memorizing creatures within 5 feet from you. (Their next turn will be skipped/They will be distracted for the 7 seconds). Ferret mode can be used as many times as you have a proficiency bonus. For these benefits, you gain 15% Infusion Rate, once you hit 100% you will become permanently your chosen animal/beast forever. When in an interaction that may have your infused side wanting to do something, you must roll a d100 if you roll above your Infusion Rate you resist that action.",
            "infusionRate" : 15
        },
        
        "ability2" : 
        {
            "name" : "Quick Ferret Nap",
            "desc" : "Your ferret side loves naps, these naps help give it the energy and dexterity it needs for survival. While in ferret mode, you can give up an action and a bonus action to heal some of your missing hp. (Current Level + Proficiency Bonus + 1d6) For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "ability3" : 
        {
            "name" : "Ferret Wildshape",
            "desc" : "By having your ferret side take over the majority of your body you will be able to wildshape into a ferret (Using Weasel D&D 5e Stat Block) for an action, this can be done proficiency bonus / 2 (rounded down) times a day. You can stay a ferret for up to 5 turns or until your HP drops to 0 (Any overflow will go to your normal hp same as druid) Once unwildshaped, you must wait 10 minutes before using the ability again, as your ferret side needs time to recharge. For these benefits, you gain 15% more Infusion Rate.",
            "infusionRate" : 15
        },

        "ability4" : 
        {
            "name" : "Longer Ferret Nap",
            "desc" : "With your infusion being a big part of you now, longer naps (short rest & long rest) do more healing. By going into Ferret Mode before the rest, you will roll a 1d2. On a one you will heal 1.5 the amount of hp you would for the rest. On a two you will gain the normal hp & 1/2 of the hp that was healed as Temp Hp. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "ability5" : 
        {
            "name" : "Quicken Ferret Action",
            "desc" : "With unlocking this, you can turn something that would take an action into a bonus action instead. You can do this once a turn while in ferret mode. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade1" : 
        {
            "name" : "Longer Ferret Mode",
            "desc" : "By unlocking this your Ferret Mode ability will be able to be held for 10 turns instead of the normal 5. As a bonus you also will gain +1 to Dex ability score. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade2" : 
        {
            "name" : "Enhanced Ferret Nap",
            "desc" : "By unlocking this your naps in ferret mode does more healing, instead of the normal 1d6 added to level and Proficiency, you will now heal (Current Level + Proficiency + 2d8). For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade3" : 
        {
            "name" : "Quicker Ferret Action",
            "desc" : "By unlocking this your extra bonus action while in Ferret Mode can be an action or bonus action instead. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        },

        "upgrade4" : 
        {
            "name" : "Enhanced Ferret Wildshape",
            "desc" : "By unlocking this your Ferret Wildshape gains stronger giving you many upgrades. You can now wildshape up to your proficiency bonus instead of pb/2. You also can remain in wildshape for up to 10 turns, and only need to wait 5 minutes instead of the 10 to wildshape. For these benefits, you gain 10% more Infusion Rate.",
            "infusionRate" : 10
        }
    },

    "Okami" : 
    {
        "ability1" : 
        {
            "name" : "ability1",
            "desc" : "",
            "infusionRate" : 15
        },
        
        "ability2" : 
        {
            "name" : "ability2",
            "desc" : "",
            "infusionRate" : 10
        },

        "ability3" : 
        {
            "name" : "ability3",
            "desc" : "",
            "infusionRate" : 15
        },

        "ability4" : 
        {
            "name" : "ability4",
            "desc" : "",
            "infusionRate" : 10
        },

        "ability5" : 
        {
            "name" : "ability5",
            "desc" : "",
            "infusionRate" : 10
        },

        "upgrade1" : 
        {
            "name" : "upgrade1",
            "desc" : "",
            "infusionRate" : 10
        },

        "upgrade2" : 
        {
            "name" : "upgrade2",
            "desc" : "",
            "infusionRate" : 10
        },

        "upgrade3" : 
        {
            "name" : "upgrade3",
            "desc" : "",
            "infusionRate" : 10
        },

        "upgrade4" : 
        {
            "name" : "upgrade4",
            "desc" : "",
            "infusionRate" : 10
        }
    }
}